---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Reference.FillPattern
source: html/0f258e86-751f-a5dc-a5a9-8cd0071cf75a.htm
---
# Autodesk.Revit.DB.SpecTypeId.Reference.FillPattern Property

Fill Pattern, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId FillPattern { get; }
```